; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared3 - mode
	spectrograph2 - mode
	infrared4 - mode
	infrared5 - mode
	infrared1 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star8 - direction
	Star9 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation6 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared4)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared3)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(have_image Planet10 spectrograph2)
	(have_image Planet11 infrared0)
	(have_image Planet11 infrared4)
	(have_image Planet12 infrared5)
	(have_image Star13 spectrograph2)
	(have_image Star13 infrared4)
	(have_image Star14 spectrograph2)
	(have_image Star14 infrared0)
	(have_image Phenomenon15 infrared0)
	(have_image Planet16 spectrograph2)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet16 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet16)
   goals met: 0 of 11
5. (take_image satellite0 planet16 instrument0 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 1 of 11
6. (turn_to satellite0 planet12 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet12)
   goals met: 1 of 11
7. (take_image satellite0 planet12 instrument0 infrared5)
   added: (have_image planet12 infrared5)
   goals met: 2 of 11
8. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 2 of 11
9. (take_image satellite0 planet10 instrument0 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 3 of 11
10. (turn_to satellite0 groundstation6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 11
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 11
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 11
13. (calibrate satellite0 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 3 of 11
14. (turn_to satellite0 phenomenon15 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 11
15. (take_image satellite0 phenomenon15 instrument2 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 4 of 11
16. (turn_to satellite0 planet11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet11)
   goals met: 4 of 11
17. (take_image satellite0 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 5 of 11
18. (take_image satellite0 planet11 instrument2 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 6 of 11
19. (turn_to satellite0 star13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star13)
   goals met: 6 of 11
20. (take_image satellite0 star13 instrument2 infrared4)
   added: (have_image star13 infrared4)
   goals met: 7 of 11
21. (take_image satellite0 star13 instrument2 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 8 of 11
22. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 8 of 11
23. (take_image satellite0 star14 instrument2 infrared0)
   added: (have_image star14 infrared0)
   goals met: 9 of 11
24. (take_image satellite0 star14 instrument2 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 10 of 11
25. (turn_to satellite0 groundstation7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation7)
   goals met: 11 of 11
